benchmark/go-frameworks/results/20260924-102750/results/get/stdlib/r3/10000.txt
Running 40s test @ http://10.128.0.4:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.844ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.826ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.833ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.854ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.846ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.842ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.859ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.831ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.867ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.873ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.833ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.865ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.864ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  391.35us   3.23ms   66.10%
    Req/Sec   647.23    226.76     2.00k    90.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.85ms
 75.000%    1.12ms
 90.000%    1.35ms
 99.000%    1.85ms
 99.900%    2.09ms
 99.990%    2.51ms
 99.999%    2.94ms
100.000%    3.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.104     0.000000            1         1.00
       0.332     0.100000        29914         1.11
       0.482     0.200000        59832         1.25
       0.617     0.300000        89735         1.43
       0.737     0.400000       119447         1.67
       0.850     0.500000       149333         2.00
       0.904     0.550000       164220         2.22
       0.959     0.600000       179154         2.50
       1.015     0.650000       194185         2.86
       1.070     0.700000       209069         3.33
       1.125     0.750000       223839         4.00
       1.154     0.775000       231463         4.44
       1.182     0.800000       238728         5.00
       1.213     0.825000       246197         5.71
       1.252     0.850000       253654         6.67
       1.299     0.875000       261261         8.00
       1.323     0.887500       264903         8.89
       1.350     0.900000       268586        10.00
       1.382     0.912500       272310        11.43
       1.422     0.925000       276056        13.33
       1.470     0.937500       279795        16.00
       1.498     0.943750       281622        17.78
       1.529     0.950000       283483        20.00
       1.563     0.956250       285380        22.86
       1.599     0.962500       287237        26.67
       1.640     0.968750       289098        32.00
       1.663     0.971875       290046        35.56
       1.689     0.975000       290967        40.00
       1.717     0.978125       291892        45.71
       1.746     0.981250       292831        53.33
       1.776     0.984375       293747        64.00
       1.794     0.985938       294236        71.11
       1.813     0.987500       294690        80.00
       1.832     0.989062       295136        91.43
       1.855     0.990625       295611       106.67
       1.882     0.992188       296075       128.00
       1.896     0.992969       296304       142.22
       1.912     0.993750       296542       160.00
       1.931     0.994531       296779       182.86
       1.950     0.995313       297005       213.33
       1.973     0.996094       297238       256.00
       1.983     0.996484       297357       284.44
       1.994     0.996875       297470       320.00
       2.007     0.997266       297589       365.71
       2.018     0.997656       297701       426.67
       2.035     0.998047       297817       512.00
       2.045     0.998242       297880       568.89
       2.053     0.998437       297942       640.00
       2.061     0.998633       297995       731.43
       2.075     0.998828       298059       853.33
       2.091     0.999023       298109      1024.00
       2.099     0.999121       298139      1137.78
       2.109     0.999219       298171      1280.00
       2.119     0.999316       298197      1462.86
       2.135     0.999414       298225      1706.67
       2.153     0.999512       298254      2048.00
       2.165     0.999561       298269      2275.56
       2.177     0.999609       298285      2560.00
       2.197     0.999658       298299      2925.71
       2.245     0.999707       298312      3413.33
       2.287     0.999756       298328      4096.00
       2.327     0.999780       298335      4551.11
       2.341     0.999805       298342      5120.00
       2.387     0.999829       298349      5851.43
       2.443     0.999854       298357      6826.67
       2.479     0.999878       298363      8192.00
       2.495     0.999890       298368      9102.22
       2.517     0.999902       298370     10240.00
       2.547     0.999915       298374     11702.86
       2.601     0.999927       298378     13653.33
       2.639     0.999939       298381     16384.00
       2.651     0.999945       298383     18204.44
       2.701     0.999951       298385     20480.00
       2.723     0.999957       298387     23405.71
       2.739     0.999963       298389     27306.67
       2.763     0.999969       298390     32768.00
       2.775     0.999973       298391     36408.89
       2.791     0.999976       298392     40960.00
       2.813     0.999979       298393     46811.43
       2.817     0.999982       298394     54613.33
       2.837     0.999985       298395     65536.00
       2.837     0.999986       298395     72817.78
       2.945     0.999988       298396     81920.00
       2.945     0.999989       298396     93622.86
       3.029     0.999991       298397    109226.67
       3.029     0.999992       298397    131072.00
       3.029     0.999993       298397    145635.56
       3.059     0.999994       298398    163840.00
       3.059     0.999995       298398    187245.71
       3.059     0.999995       298398    218453.33
       3.059     0.999996       298398    262144.00
       3.059     0.999997       298398    291271.11
       3.235     0.999997       298399    327680.00
       3.235     1.000000       298399          inf
#[Mean    =        0.855, StdDeviation   =        0.391]
#[Max     =        3.234, Total count    =       298399]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  398901 requests in 40.02s, 144.56MB read
Requests/sec:   9968.71
Transfer/sec:      3.61MB